InformationRegisters/мегапрайсЦеныНоменклатурыПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<InformationRegister>
		<Properties>
			<Name>мегапрайсЦеныНоменклатурыПоставщиков</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МинимальныйЗаказ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокПоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПрайсПартнера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.мегапрайсПрофилиПрайсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатураПоставщика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураПоставщиков</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поле_Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючСтроки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НоменклатураПоставщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Catalog>
		<Properties>
			<Name>НоменклатураПоставщиков</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Партнеры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>110</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/мегапрайсЦеныНоменклатурыПоставщиков/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура Справочники_СоздатьНоменклатуруПоставщика() 	 
	
	Если НЕ ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Возврат;
	КонецЕсли;
		
	НоменклатураПоставщикаИмеетНесколькоСоответствий = Запись.ПрайсПартнера.НоменклатураПоставщикаИмеетНесколькоСоответствий;	
	
	Запрос = Новый Запрос();
	ТекстЗапроса = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураПоставщиков.Ссылка,
	|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура,
	|	НоменклатураПоставщиков.Характеристика КАК ХарактеристикаНоменклатуры,
	|	НоменклатураПоставщиков.Упаковка
	|ИЗ
	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	|ГДЕ
	|	НоменклатураПоставщиков.Номенклатура = &Номенклатура
	|	И НоменклатураПоставщиков.Характеристика = &Характеристика
	|	И НоменклатураПоставщиков.Владелец = &Партнер";  	 
	Если НоменклатураПоставщикаИмеетНесколькоСоответствий Тогда
		ТекстЗапроса = ТекстЗапроса + "
		|	И НоменклатураПоставщиков.Идентификатор = &Поле_Идентификатор
		|	И НоменклатураПоставщиков.Артикул = &Поле_Артикул
		|	И НоменклатураПоставщиков.Наименование = &Поле_Наименование"; 
		
		Запрос.УстановитьПараметр("Поле_Идентификатор", Запись.Поле_Идентификатор);
		Запрос.УстановитьПараметр("Поле_Артикул", Запись.Поле_Артикул);
		Запрос.УстановитьПараметр("Поле_Наименование", Запись.Поле_Наименование);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", Запись.Номенклатура);
	Запрос.УстановитьПараметр("Характеристика", Запись.ХарактеристикаНоменклатуры);
	Запрос.УстановитьПараметр("Партнер", Запись.ПрайсПартнера.Партнер);
	
	Запрос.Текст = ТекстЗапроса;
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда				 
		НовыйЭлемент = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
		НовыйЭлемент.Владелец       = Запись.ПрайсПартнера.Партнер;
		НовыйЭлемент.Номенклатура   = Запись.Номенклатура;
		НовыйЭлемент.Характеристика = Запись.ХарактеристикаНоменклатуры;
		НовыйЭлемент.Наименование   = Запись.Поле_Наименование;
		Если ЗначениеЗаполнено(Запись.Поле_Артикул) Тогда
			НовыйЭлемент.Артикул = СокрЛП(Запись.Поле_Артикул);
		КонецЕсли;
		Если ЗначениеЗаполнено(Запись.Поле_Идентификатор) Тогда
			НовыйЭлемент.Идентификатор  = СокрЛП(Запись.Поле_Идентификатор);
		КонецЕсли;	
		НовыйЭлемент.УстановитьНовыйКод();
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		Запись.НоменклатураПоставщика = НовыйЭлемент.Ссылка;
	Иначе			 
		Выборка  = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл				
			Если НоменклатураПоставщикаИмеетНесколькоСоответствий Тогда
				НовыйЭлемент = Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
				НовыйЭлемент.УстановитьНовыйКод();
				ТекстСообщения = "Внимание! У товара "+Запись.Номенклатура+" - появился дубль номенклатуры поставщика";
			Иначе
				НовыйЭлемент = Выборка.Ссылка.ПолучитьОбъект();
				ТекстСообщения = "Был найден элемент Номенклатуры поставщика по товару "+Запись.Номенклатура+" - элемент обновлен новыми данными";
			КонецЕсли;
			НовыйЭлемент.Владелец       = Запись.ПрайсПартнера.Партнер;
			НовыйЭлемент.Номенклатура   = Запись.Номенклатура;
			НовыйЭлемент.Характеристика = Запись.ХарактеристикаНоменклатуры;
			НовыйЭлемент.Наименование   = Запись.Поле_Наименование;
			Если ЗначениеЗаполнено(Запись.Поле_Артикул) Тогда
				НовыйЭлемент.Артикул = СокрЛП(Запись.Поле_Артикул);
			КонецЕсли;
			Если ЗначениеЗаполнено(Запись.Поле_Идентификатор) Тогда
				НовыйЭлемент.Идентификатор  = СокрЛП(Запись.Поле_Идентификатор);
			КонецЕсли;	
			НовыйЭлемент.ОбменДанными.Загрузка = Истина;
			НовыйЭлемент.Записать();	
			Запись.НоменклатураПоставщика = НовыйЭлемент.Ссылка;
		КонецЦикла;
	КонецЕсли;
	
КОнецПроцедуры


&НаКлиенте
Процедура СоздатьНоменклатуруПоставщика(Команда)
	
	Справочники_СоздатьНоменклатуруПоставщика();
	
КонецПроцедуры
